import Image from "next/image";
import { useRouter } from "next/router";

const Footer = () => {
  const router = useRouter();

  return (
    <footer className="flex flex-col max-w-[1920px] mx-auto justify-center items-center mt-auto">
      <div className="flex max-md:flex-col gap-10 max-md:gap-8 bg-[#01578C] w-full text-white max-md:py-10 max-md:text-center rounded-t-2xl min-h-[200px] items-center px-10 justify-center">
        <div className="text-center flex flex-col text-[14px] gap-2 w-[100px]">
          <Image
            className="w-[130px]"
            src="/images/logo-dark.png"
            width={200}
            height={200}
          />
          <p>
            <span className="">کلینیک دندانپزشکی دکتر علی علائی</span>
          </p>
          <button
            className="text-[10px] bg-[#29D8DB] w-fit mx-auto px-2 py-1 rounded-xl hover:bg-[#29D8DB90] transition-all duration-300"
            onClick={() => router.push("/account")}
          >
            پنل مدیریت
          </button>
        </div>
        <div className="flex flex-col gap-4">
          <p>تماس با ما</p>
          <div>
            <p className="font-Irancell_ExtraLight">۰۲۱-۳۴۳۵۶</p>
            <p className="font-Irancell_ExtraLight">۰۲۱-۳۴۳۵۶</p>
          </div>
        </div>
        <div className="flex flex-col gap-4 max-md:text-center">
          <p>آدرس ما</p>
          <p className="font-Irancell_ExtraLight max-w-[310px]">
            تهران، خیابان مطهری، نرسیده به خیابان رضایی، ساختمان پزشکان، طبقه‌ی
            ۳، واحد ۵
          </p>
        </div>
        <div className="flex flex-col gap-4">
          <p>ساعت کاری ما</p>
          <p className="flex flex-col whitespace-nowrap">
            <span className="font-Irancell_ExtraLight"> شنبه تا چهارشنبه</span>
            <span className="font-Irancell_ExtraLight">
              {" "}
              ۱۰ صبح تا ۱۸ بعدازظهر
            </span>
          </p>
        </div>
        <div className="flex flex-col gap-4 whitespace-nowrap">
          <p>شبکه‌های اجتماعی</p>
          <div className="flex gap-2 max-md:justify-center ">
            <button className="bg-[#29D8DB] hover:opacity-80 transition-all duration-300 text-white p-2 rounded-xl whitespace-nowrap">
              <svg
                width="24"
                height="24"
                viewBox="0 0 24 24"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M15 22.75H9C3.57 22.75 1.25 20.43 1.25 15V9C1.25 3.57 3.57 1.25 9 1.25H15C20.43 1.25 22.75 3.57 22.75 9V15C22.75 20.43 20.43 22.75 15 22.75ZM9 2.75C4.39 2.75 2.75 4.39 2.75 9V15C2.75 19.61 4.39 21.25 9 21.25H15C19.61 21.25 21.25 19.61 21.25 15V9C21.25 4.39 19.61 2.75 15 2.75H9Z"
                  fill="#ffffff"
                />
                <path
                  d="M12 16.25C9.66 16.25 7.75 14.34 7.75 12C7.75 9.66 9.66 7.75 12 7.75C14.34 7.75 16.25 9.66 16.25 12C16.25 14.34 14.34 16.25 12 16.25ZM12 9.25C10.48 9.25 9.25 10.48 9.25 12C9.25 13.52 10.48 14.75 12 14.75C13.52 14.75 14.75 13.52 14.75 12C14.75 10.48 13.52 9.25 12 9.25Z"
                  fill="#ffffff"
                />
                <path
                  d="M17 7.50003C16.87 7.50003 16.74 7.47003 16.62 7.42003C16.5 7.37003 16.39 7.30003 16.29 7.21003C16.2 7.11003 16.12 7.00003 16.07 6.88003C16.02 6.76003 16 6.63003 16 6.50003C16 6.37003 16.02 6.24003 16.07 6.12003C16.13 5.99003 16.2 5.89003 16.29 5.79003C16.34 5.75003 16.39 5.70003 16.44 5.67003C16.5 5.63003 16.56 5.60003 16.62 5.58003C16.68 5.55003 16.74 5.53003 16.81 5.52003C17.13 5.45003 17.47 5.56003 17.71 5.79003C17.8 5.89003 17.87 5.99003 17.92 6.12003C17.97 6.24003 18 6.37003 18 6.50003C18 6.63003 17.97 6.76003 17.92 6.88003C17.87 7.00003 17.8 7.11003 17.71 7.21003C17.61 7.30003 17.5 7.37003 17.38 7.42003C17.26 7.47003 17.13 7.50003 17 7.50003Z"
                  fill="#ffffff"
                />
              </svg>
            </button>

            <button className="bg-[#29D8DB] hover:opacity-80 transition-all duration-300 text-white p-2 rounded-xl whitespace-nowrap">
              <svg
                width="24"
                height="24"
                viewBox="0 0 24 24"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M2.00014 22.75C1.80014 22.75 1.61011 22.67 1.47011 22.53C1.28011 22.34 1.20016 22.06 1.27016 21.8L2.53017 17.09C1.69017 15.53 1.25014 13.77 1.25014 11.99C1.25014 6.05999 6.07014 1.23999 12.0001 1.23999C17.9301 1.23999 22.7501 6.05999 22.7501 11.99C22.7501 17.92 17.9301 22.74 12.0001 22.74C10.1901 22.74 8.42017 22.29 6.84017 21.43L2.20015 22.72C2.13015 22.74 2.07014 22.75 2.00014 22.75ZM6.94014 19.88C7.07014 19.88 7.20015 19.92 7.32015 19.98C8.73015 20.81 10.3501 21.25 12.0001 21.25C17.1001 21.25 21.2501 17.1 21.2501 12C21.2501 6.9 17.1001 2.75 12.0001 2.75C6.90014 2.75 2.75014 6.9 2.75014 12C2.75014 13.63 3.18013 15.22 3.99013 16.62C4.09013 16.79 4.12015 17 4.07015 17.19L3.07015 20.93L6.75014 19.91C6.81014 19.89 6.88014 19.88 6.94014 19.88Z"
                  fill="#ffffff"
                />
                <path
                  d="M14.74 17.7601C14.12 17.7601 13.48 17.62 12.81 17.33C12.18 17.06 11.55 16.7 10.94 16.25C10.34 15.81 9.75002 15.31 9.21002 14.77C8.67002 14.22 8.16998 13.6401 7.72998 13.0401C7.27998 12.4101 6.91997 11.79 6.65997 11.18C6.37997 10.52 6.23999 9.87004 6.23999 9.25004C6.23999 8.81004 6.31997 8.39004 6.46997 8.00004C6.62997 7.59004 6.88998 7.22004 7.22998 6.90004C7.86998 6.27004 8.79002 6.04006 9.52002 6.39006C9.77002 6.50006 9.98001 6.68006 10.14 6.92006L11.3 8.55003C11.42 8.71003 11.51 8.88003 11.58 9.05003C11.66 9.25003 11.71 9.45006 11.71 9.64006C11.71 9.90006 11.64 10.1601 11.5 10.3901C11.41 10.5401 11.28 10.7201 11.11 10.8901L10.98 11.03C11.04 11.11 11.11 11.21 11.22 11.33C11.43 11.57 11.66 11.83 11.91 12.08C12.16 12.32 12.41 12.56 12.66 12.77C12.78 12.87 12.88 12.95 12.96 13L13.1 12.86C13.28 12.68 13.46 12.5401 13.64 12.4501C13.97 12.2401 14.48 12.19 14.93 12.38C15.09 12.44 15.25 12.53 15.42 12.65L17.09 13.83C17.32 13.99 17.5 14.21 17.62 14.46C17.72 14.71 17.76 14.93 17.76 15.16C17.76 15.46 17.69 15.75 17.56 16.03C17.43 16.29 17.28 16.5201 17.1 16.7301C16.78 17.0801 16.41 17.3401 16.01 17.5101C15.61 17.6801 15.18 17.7601 14.74 17.7601ZM8.78998 7.74003C8.72998 7.74003 8.53003 7.74003 8.28003 7.99003C8.09003 8.17003 7.96 8.36005 7.87 8.57005C7.78 8.78005 7.73999 9.02005 7.73999 9.26005C7.73999 9.68005 7.83998 10.13 8.03998 10.61C8.24998 11.11 8.56 11.6401 8.94 12.1701C9.33 12.7001 9.77001 13.23 10.26 13.72C10.75 14.2 11.27 14.65 11.81 15.05C12.33 15.43 12.86 15.73 13.39 15.96C14.15 16.29 14.85 16.37 15.42 16.13C15.62 16.05 15.8 15.9101 15.98 15.7301C16.07 15.6301 16.14 15.53 16.2 15.4C16.23 15.33 16.25 15.25 16.25 15.18C16.25 15.16 16.25 15.13 16.22 15.07L14.55 13.91C14.48 13.86 14.41 13.82 14.35 13.8C14.31 13.82 14.25 13.85 14.14 13.96L13.76 14.34C13.47 14.63 13.01 14.71 12.64 14.58L12.46 14.5C12.23 14.38 11.97 14.2001 11.68 13.9501C11.4 13.7101 11.13 13.46 10.84 13.18C10.56 12.89 10.31 12.62 10.07 12.34C9.81001 12.03 9.63001 11.78 9.51001 11.57L9.40002 11.31C9.37002 11.21 9.35999 11.1 9.35999 11C9.35999 10.72 9.46002 10.47 9.65002 10.27L10.03 9.88005C10.14 9.77005 10.18 9.71006 10.2 9.67006C10.17 9.60006 10.13 9.54004 10.08 9.47004L8.90997 7.82005L8.78998 7.74003Z"
                  fill="#ffffff"
                />
              </svg>
            </button>
          </div>
        </div>
      </div>
      <div className="w-[1px] h-[1px] bg-white"></div>
      <div className="flex py-2 px-5 text-center items-center font-Irancell_Light gap-1 h-fit w-full text-white bg-[#01578C] justify-center">
        تمام حقوق این وبسایت متعلق به دکتر علی علائی می‌باشد.
      </div>
    </footer>
  );
};

export default Footer;
